results/ai-agent-continuous/logs/cpu-spike-logs/k6-cpu-spike-run4.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/40 VUs  0m01.0s/1m00.0s

running (0m02.0s), 08/40 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/40 VUs  0m02.0s/1m00.0s

running (0m03.0s), 12/40 VUs, 15 complete and 0 interrupted iterations
default   [   5% ] 12/40 VUs  0m03.0s/1m00.0s

running (0m04.0s), 16/40 VUs, 30 complete and 0 interrupted iterations
default   [   7% ] 16/40 VUs  0m04.0s/1m00.0s

running (0m05.0s), 20/40 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 20/40 VUs  0m05.0s/1m00.0s

running (0m06.0s), 24/40 VUs, 82 complete and 0 interrupted iterations
default   [  10% ] 24/40 VUs  0m06.0s/1m00.0s

running (0m07.0s), 28/40 VUs, 115 complete and 0 interrupted iterations
default   [  12% ] 28/40 VUs  0m07.0s/1m00.0s

running (0m08.0s), 32/40 VUs, 156 complete and 0 interrupted iterations
default   [  13% ] 32/40 VUs  0m08.0s/1m00.0s

running (0m09.0s), 36/40 VUs, 195 complete and 0 interrupted iterations
default   [  15% ] 36/40 VUs  0m09.0s/1m00.0s

running (0m10.0s), 39/40 VUs, 243 complete and 0 interrupted iterations
default   [  17% ] 39/40 VUs  0m10.0s/1m00.0s

running (0m11.0s), 40/40 VUs, 285 complete and 0 interrupted iterations
default   [  18% ] 40/40 VUs  0m11.0s/1m00.0s

running (0m12.0s), 40/40 VUs, 343 complete and 0 interrupted iterations
default   [  20% ] 40/40 VUs  0m12.0s/1m00.0s

running (0m13.0s), 40/40 VUs, 392 complete and 0 interrupted iterations
default   [  22% ] 40/40 VUs  0m13.0s/1m00.0s

running (0m14.0s), 40/40 VUs, 435 complete and 0 interrupted iterations
default   [  23% ] 40/40 VUs  0m14.0s/1m00.0s

running (0m15.0s), 40/40 VUs, 483 complete and 0 interrupted iterations
default   [  25% ] 40/40 VUs  0m15.0s/1m00.0s

running (0m16.0s), 40/40 VUs, 544 complete and 0 interrupted iterations
default   [  27% ] 40/40 VUs  0m16.0s/1m00.0s

running (0m17.0s), 40/40 VUs, 595 complete and 0 interrupted iterations
default   [  28% ] 40/40 VUs  0m17.0s/1m00.0s

running (0m18.0s), 40/40 VUs, 638 complete and 0 interrupted iterations
default   [  30% ] 40/40 VUs  0m18.0s/1m00.0s

running (0m19.0s), 40/40 VUs, 686 complete and 0 interrupted iterations
default   [  32% ] 40/40 VUs  0m19.0s/1m00.0s

running (0m20.0s), 40/40 VUs, 735 complete and 0 interrupted iterations
default   [  33% ] 40/40 VUs  0m20.0s/1m00.0s

running (0m21.0s), 40/40 VUs, 784 complete and 0 interrupted iterations
default   [  35% ] 40/40 VUs  0m21.0s/1m00.0s

running (0m22.0s), 40/40 VUs, 843 complete and 0 interrupted iterations
default   [  37% ] 40/40 VUs  0m22.0s/1m00.0s

running (0m23.0s), 40/40 VUs, 891 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  0m23.0s/1m00.0s

running (0m24.0s), 40/40 VUs, 935 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  0m24.0s/1m00.0s

running (0m25.0s), 40/40 VUs, 989 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  0m25.0s/1m00.0s

running (0m26.0s), 40/40 VUs, 1047 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  0m26.0s/1m00.0s

running (0m27.0s), 40/40 VUs, 1095 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  0m27.0s/1m00.0s

running (0m28.0s), 40/40 VUs, 1136 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  0m28.0s/1m00.0s

running (0m29.0s), 40/40 VUs, 1196 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  0m29.0s/1m00.0s

running (0m30.0s), 40/40 VUs, 1255 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  0m30.0s/1m00.0s

running (0m31.0s), 40/40 VUs, 1299 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  0m31.0s/1m00.0s

running (0m32.0s), 40/40 VUs, 1342 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  0m32.0s/1m00.0s

running (0m33.0s), 40/40 VUs, 1398 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  0m33.0s/1m00.0s

running (0m34.0s), 40/40 VUs, 1451 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  0m34.0s/1m00.0s

running (0m35.0s), 40/40 VUs, 1500 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  0m35.0s/1m00.0s

running (0m36.0s), 40/40 VUs, 1544 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  0m36.0s/1m00.0s

running (0m37.0s), 40/40 VUs, 1593 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  0m37.0s/1m00.0s

running (0m38.0s), 40/40 VUs, 1649 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  0m38.0s/1m00.0s

running (0m39.0s), 40/40 VUs, 1705 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  0m39.0s/1m00.0s

running (0m40.0s), 40/40 VUs, 1748 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  0m40.0s/1m00.0s

running (0m41.0s), 40/40 VUs, 1796 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  0m41.0s/1m00.0s

running (0m42.0s), 40/40 VUs, 1850 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  0m42.0s/1m00.0s

running (0m43.0s), 40/40 VUs, 1906 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  0m43.0s/1m00.0s

running (0m44.0s), 40/40 VUs, 1956 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  0m44.0s/1m00.0s

running (0m45.0s), 40/40 VUs, 2001 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  0m45.0s/1m00.0s

running (0m46.0s), 40/40 VUs, 2054 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  0m46.0s/1m00.0s

running (0m47.0s), 40/40 VUs, 2107 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  0m47.0s/1m00.0s

running (0m48.0s), 40/40 VUs, 2158 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  0m48.0s/1m00.0s

running (0m49.0s), 40/40 VUs, 2211 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  0m49.0s/1m00.0s

running (0m50.0s), 40/40 VUs, 2256 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  0m50.0s/1m00.0s

running (0m51.0s), 39/40 VUs, 2306 complete and 0 interrupted iterations
default   [  85% ] 39/40 VUs  0m51.0s/1m00.0s

running (0m52.0s), 34/40 VUs, 2360 complete and 0 interrupted iterations
default   [  87% ] 34/40 VUs  0m52.0s/1m00.0s

running (0m53.0s), 30/40 VUs, 2404 complete and 0 interrupted iterations
default   [  88% ] 30/40 VUs  0m53.0s/1m00.0s

running (0m54.0s), 26/40 VUs, 2445 complete and 0 interrupted iterations
default   [  90% ] 26/40 VUs  0m54.0s/1m00.0s

running (0m55.0s), 22/40 VUs, 2484 complete and 0 interrupted iterations
default   [  92% ] 22/40 VUs  0m55.0s/1m00.0s

running (0m56.0s), 19/40 VUs, 2513 complete and 0 interrupted iterations
default   [  93% ] 19/40 VUs  0m56.0s/1m00.0s

running (0m57.0s), 14/40 VUs, 2541 complete and 0 interrupted iterations
default   [  95% ] 14/40 VUs  0m57.0s/1m00.0s

running (0m58.0s), 10/40 VUs, 2557 complete and 0 interrupted iterations
default   [  97% ] 10/40 VUs  0m58.0s/1m00.0s

running (0m59.0s), 06/40 VUs, 2574 complete and 0 interrupted iterations
default   [  98% ] 06/40 VUs  0m59.0s/1m00.0s

running (1m00.0s), 02/40 VUs, 2581 complete and 0 interrupted iterations
default   [ 100% ] 02/40 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 7749   128.637459/s
    checks_succeeded...: 66.66% 5166 out of 7749
    checks_failed......: 33.33% 2583 out of 7749

    ✓ Homepage loaded
    ✓ Added to cart
    ✗ Checkout successful
      ↳  0% — ✓ 0 / ✗ 2583

    HTTP
    http_req_duration..............: avg=182.23ms min=146.47ms med=176.43ms max=1.07s p(90)=217.67ms p(95)=228.94ms
      { expected_response:true }...: avg=184.33ms min=146.47ms med=177.44ms max=1.07s p(90)=221.88ms p(95)=233.46ms
    http_req_failed................: 25.00% 2583 out of 10332
    http_reqs......................: 10332  171.516612/s

    EXECUTION
    iteration_duration.............: avg=781.97ms min=658.36ms med=787.96ms max=1.92s p(90)=833.75ms p(95)=858.16ms
    iterations.....................: 2583   42.879153/s
    vus............................: 2      min=2             max=40
    vus_max........................: 40     min=40            max=40

    NETWORK
    data_received..................: 83 MB  1.4 MB/s
    data_sent......................: 2.6 MB 43 kB/s



running (1m00.2s), 00/40 VUs, 2583 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m0s